logs/bench.log
WARNING: Could not fetch server CONFIG
====== PING_INLINE ======
  1000000 requests completed in 15.54 seconds
  1000 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 1.999 milliseconds (cumulative count 1)
50.000% <= 7.207 milliseconds (cumulative count 501129)
75.000% <= 8.831 milliseconds (cumulative count 750378)
87.500% <= 10.719 milliseconds (cumulative count 875183)
93.750% <= 12.567 milliseconds (cumulative count 937611)
96.875% <= 14.087 milliseconds (cumulative count 968824)
98.438% <= 15.575 milliseconds (cumulative count 984380)
99.219% <= 16.607 milliseconds (cumulative count 992192)
99.609% <= 17.855 milliseconds (cumulative count 996095)
99.805% <= 20.111 milliseconds (cumulative count 998051)
99.902% <= 35.551 milliseconds (cumulative count 999030)
99.951% <= 39.583 milliseconds (cumulative count 999514)
99.976% <= 46.815 milliseconds (cumulative count 999756)
99.988% <= 53.407 milliseconds (cumulative count 999878)
99.994% <= 54.911 milliseconds (cumulative count 999944)
99.997% <= 55.135 milliseconds (cumulative count 999973)
99.998% <= 55.711 milliseconds (cumulative count 999985)
99.999% <= 56.639 milliseconds (cumulative count 999993)
100.000% <= 56.895 milliseconds (cumulative count 999997)
100.000% <= 56.991 milliseconds (cumulative count 1000000)
100.000% <= 56.991 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.000% <= 2.007 milliseconds (cumulative count 2)
0.001% <= 2.103 milliseconds (cumulative count 10)
0.034% <= 3.103 milliseconds (cumulative count 335)
1.242% <= 4.103 milliseconds (cumulative count 12419)
8.305% <= 5.103 milliseconds (cumulative count 83050)
26.104% <= 6.103 milliseconds (cumulative count 261044)
48.144% <= 7.103 milliseconds (cumulative count 481439)
65.534% <= 8.103 milliseconds (cumulative count 655335)
77.791% <= 9.103 milliseconds (cumulative count 777911)
84.572% <= 10.103 milliseconds (cumulative count 845723)
89.107% <= 11.103 milliseconds (cumulative count 891067)
92.439% <= 12.103 milliseconds (cumulative count 924395)
95.015% <= 13.103 milliseconds (cumulative count 950148)
96.905% <= 14.103 milliseconds (cumulative count 969050)
98.050% <= 15.103 milliseconds (cumulative count 980497)
98.923% <= 16.103 milliseconds (cumulative count 989227)
99.407% <= 17.103 milliseconds (cumulative count 994068)
99.652% <= 18.111 milliseconds (cumulative count 996517)
99.754% <= 19.103 milliseconds (cumulative count 997540)
99.805% <= 20.111 milliseconds (cumulative count 998051)
99.823% <= 21.103 milliseconds (cumulative count 998235)
99.828% <= 22.111 milliseconds (cumulative count 998279)
99.830% <= 23.103 milliseconds (cumulative count 998295)
99.838% <= 24.111 milliseconds (cumulative count 998376)
99.842% <= 25.103 milliseconds (cumulative count 998420)
99.844% <= 26.111 milliseconds (cumulative count 998441)
99.847% <= 27.103 milliseconds (cumulative count 998468)
99.849% <= 28.111 milliseconds (cumulative count 998485)
99.850% <= 29.103 milliseconds (cumulative count 998502)
99.852% <= 30.111 milliseconds (cumulative count 998521)
99.853% <= 31.103 milliseconds (cumulative count 998526)
99.860% <= 32.111 milliseconds (cumulative count 998599)
99.869% <= 33.119 milliseconds (cumulative count 998690)
99.883% <= 34.111 milliseconds (cumulative count 998828)
99.897% <= 35.103 milliseconds (cumulative count 998966)
99.908% <= 36.127 milliseconds (cumulative count 999079)
99.919% <= 37.119 milliseconds (cumulative count 999193)
99.926% <= 38.111 milliseconds (cumulative count 999256)
99.940% <= 39.103 milliseconds (cumulative count 999401)
99.957% <= 40.127 milliseconds (cumulative count 999569)
99.963% <= 41.119 milliseconds (cumulative count 999629)
99.966% <= 42.111 milliseconds (cumulative count 999659)
99.968% <= 43.103 milliseconds (cumulative count 999680)
99.970% <= 44.127 milliseconds (cumulative count 999700)
99.972% <= 45.119 milliseconds (cumulative count 999721)
99.974% <= 46.111 milliseconds (cumulative count 999742)
99.976% <= 47.103 milliseconds (cumulative count 999762)
99.978% <= 48.127 milliseconds (cumulative count 999784)
99.981% <= 49.119 milliseconds (cumulative count 999806)
99.983% <= 50.111 milliseconds (cumulative count 999825)
99.984% <= 51.103 milliseconds (cumulative count 999839)
99.986% <= 52.127 milliseconds (cumulative count 999861)
99.988% <= 53.119 milliseconds (cumulative count 999876)
99.989% <= 54.111 milliseconds (cumulative count 999890)
99.997% <= 55.103 milliseconds (cumulative count 999968)
99.999% <= 56.127 milliseconds (cumulative count 999988)
100.000% <= 57.119 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 64366.63 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        7.826     1.992     7.207    13.103    16.231    56.991
====== PING_MBULK ======
  1000000 requests completed in 10.52 seconds
  1000 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 1.695 milliseconds (cumulative count 1)
50.000% <= 5.055 milliseconds (cumulative count 500150)
75.000% <= 6.207 milliseconds (cumulative count 751379)
87.500% <= 6.975 milliseconds (cumulative count 875384)
93.750% <= 7.719 milliseconds (cumulative count 937623)
96.875% <= 8.831 milliseconds (cumulative count 968919)
98.438% <= 9.975 milliseconds (cumulative count 984375)
99.219% <= 10.799 milliseconds (cumulative count 992189)
99.609% <= 11.551 milliseconds (cumulative count 996116)
99.805% <= 12.303 milliseconds (cumulative count 998053)
99.902% <= 13.015 milliseconds (cumulative count 999028)
99.951% <= 14.351 milliseconds (cumulative count 999514)
99.976% <= 15.119 milliseconds (cumulative count 999759)
99.988% <= 15.983 milliseconds (cumulative count 999878)
99.994% <= 16.463 milliseconds (cumulative count 999940)
99.997% <= 16.671 milliseconds (cumulative count 999970)
99.998% <= 16.863 milliseconds (cumulative count 999985)
99.999% <= 17.023 milliseconds (cumulative count 999993)
100.000% <= 17.247 milliseconds (cumulative count 999997)
100.000% <= 17.999 milliseconds (cumulative count 999999)
100.000% <= 19.007 milliseconds (cumulative count 1000000)
100.000% <= 19.007 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.000% <= 1.703 milliseconds (cumulative count 3)
0.004% <= 1.807 milliseconds (cumulative count 37)
0.006% <= 1.903 milliseconds (cumulative count 62)
0.009% <= 2.007 milliseconds (cumulative count 90)
0.011% <= 2.103 milliseconds (cumulative count 111)
1.555% <= 3.103 milliseconds (cumulative count 15553)
26.584% <= 4.103 milliseconds (cumulative count 265841)
51.083% <= 5.103 milliseconds (cumulative count 510826)
73.031% <= 6.103 milliseconds (cumulative count 730305)
89.008% <= 7.103 milliseconds (cumulative count 890078)
95.248% <= 8.103 milliseconds (cumulative count 952478)
97.353% <= 9.103 milliseconds (cumulative count 973526)
98.599% <= 10.103 milliseconds (cumulative count 985989)
99.409% <= 11.103 milliseconds (cumulative count 994085)
99.770% <= 12.103 milliseconds (cumulative count 997700)
99.911% <= 13.103 milliseconds (cumulative count 999108)
99.947% <= 14.103 milliseconds (cumulative count 999470)
99.975% <= 15.103 milliseconds (cumulative count 999753)
99.990% <= 16.103 milliseconds (cumulative count 999900)
99.999% <= 17.103 milliseconds (cumulative count 999994)
100.000% <= 18.111 milliseconds (cumulative count 999999)
100.000% <= 19.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 95066.07 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        5.292     1.688     5.055     8.023    10.511    19.007
====== SET ======
  1000000 requests completed in 9.03 seconds
  1000 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.023 milliseconds (cumulative count 151)
50.000% <= 4.367 milliseconds (cumulative count 502033)
75.000% <= 4.999 milliseconds (cumulative count 752290)
87.500% <= 5.615 milliseconds (cumulative count 875821)
93.750% <= 6.455 milliseconds (cumulative count 937734)
96.875% <= 7.343 milliseconds (cumulative count 968874)
98.438% <= 8.279 milliseconds (cumulative count 984380)
99.219% <= 8.967 milliseconds (cumulative count 992198)
99.609% <= 9.639 milliseconds (cumulative count 996106)
99.805% <= 10.591 milliseconds (cumulative count 998047)
99.902% <= 21.775 milliseconds (cumulative count 999024)
99.951% <= 41.855 milliseconds (cumulative count 999514)
99.976% <= 44.191 milliseconds (cumulative count 999757)
99.988% <= 46.047 milliseconds (cumulative count 999879)
99.994% <= 46.911 milliseconds (cumulative count 999939)
99.997% <= 47.551 milliseconds (cumulative count 999971)
99.998% <= 48.031 milliseconds (cumulative count 999985)
99.999% <= 48.959 milliseconds (cumulative count 999993)
100.000% <= 49.407 milliseconds (cumulative count 999998)
100.000% <= 49.471 milliseconds (cumulative count 999999)
100.000% <= 49.535 milliseconds (cumulative count 1000000)
100.000% <= 49.535 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.158% <= 0.103 milliseconds (cumulative count 1584)
0.209% <= 0.207 milliseconds (cumulative count 2089)
0.255% <= 0.303 milliseconds (cumulative count 2551)
0.300% <= 0.407 milliseconds (cumulative count 2997)
0.325% <= 0.503 milliseconds (cumulative count 3254)
0.347% <= 0.607 milliseconds (cumulative count 3467)
0.347% <= 0.703 milliseconds (cumulative count 3474)
0.348% <= 0.807 milliseconds (cumulative count 3476)
0.348% <= 0.903 milliseconds (cumulative count 3478)
0.348% <= 1.007 milliseconds (cumulative count 3479)
0.349% <= 1.303 milliseconds (cumulative count 3491)
0.351% <= 1.407 milliseconds (cumulative count 3513)
0.352% <= 1.503 milliseconds (cumulative count 3520)
0.353% <= 1.607 milliseconds (cumulative count 3532)
0.355% <= 1.703 milliseconds (cumulative count 3547)
0.357% <= 1.807 milliseconds (cumulative count 3566)
0.359% <= 1.903 milliseconds (cumulative count 3586)
0.360% <= 2.007 milliseconds (cumulative count 3598)
0.368% <= 2.103 milliseconds (cumulative count 3684)
4.290% <= 3.103 milliseconds (cumulative count 42903)
38.051% <= 4.103 milliseconds (cumulative count 380511)
78.222% <= 5.103 milliseconds (cumulative count 782222)
91.947% <= 6.103 milliseconds (cumulative count 919469)
96.201% <= 7.103 milliseconds (cumulative count 962013)
98.214% <= 8.103 milliseconds (cumulative count 982140)
99.303% <= 9.103 milliseconds (cumulative count 993035)
99.750% <= 10.103 milliseconds (cumulative count 997497)
99.844% <= 11.103 milliseconds (cumulative count 998439)
99.887% <= 12.103 milliseconds (cumulative count 998870)
99.891% <= 13.103 milliseconds (cumulative count 998908)
99.893% <= 14.103 milliseconds (cumulative count 998934)
99.900% <= 15.103 milliseconds (cumulative count 998996)
99.901% <= 16.103 milliseconds (cumulative count 999009)
99.901% <= 18.111 milliseconds (cumulative count 999012)
99.902% <= 19.103 milliseconds (cumulative count 999017)
99.902% <= 20.111 milliseconds (cumulative count 999020)
99.903% <= 22.111 milliseconds (cumulative count 999025)
99.903% <= 23.103 milliseconds (cumulative count 999027)
99.903% <= 24.111 milliseconds (cumulative count 999032)
99.904% <= 25.103 milliseconds (cumulative count 999036)
99.905% <= 26.111 milliseconds (cumulative count 999047)
99.905% <= 27.103 milliseconds (cumulative count 999054)
99.906% <= 28.111 milliseconds (cumulative count 999060)
99.906% <= 29.103 milliseconds (cumulative count 999063)
99.906% <= 30.111 milliseconds (cumulative count 999065)
99.907% <= 31.103 milliseconds (cumulative count 999070)
99.907% <= 32.111 milliseconds (cumulative count 999075)
99.908% <= 34.111 milliseconds (cumulative count 999078)
99.910% <= 36.127 milliseconds (cumulative count 999098)
99.916% <= 37.119 milliseconds (cumulative count 999165)
99.924% <= 38.111 milliseconds (cumulative count 999241)
99.929% <= 39.103 milliseconds (cumulative count 999289)
99.936% <= 40.127 milliseconds (cumulative count 999357)
99.944% <= 41.119 milliseconds (cumulative count 999441)
99.956% <= 42.111 milliseconds (cumulative count 999555)
99.967% <= 43.103 milliseconds (cumulative count 999669)
99.975% <= 44.127 milliseconds (cumulative count 999752)
99.982% <= 45.119 milliseconds (cumulative count 999823)
99.989% <= 46.111 milliseconds (cumulative count 999886)
99.995% <= 47.103 milliseconds (cumulative count 999952)
99.999% <= 48.127 milliseconds (cumulative count 999988)
99.999% <= 49.119 milliseconds (cumulative count 999994)
100.000% <= 50.111 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 110778.77 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        4.569     0.016     4.367     6.759     8.751    49.535
====== GET ======
  1000000 requests completed in 10.98 seconds
  1000 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.047 milliseconds (cumulative count 1)
50.000% <= 4.919 milliseconds (cumulative count 500874)
75.000% <= 6.063 milliseconds (cumulative count 750410)
87.500% <= 7.415 milliseconds (cumulative count 875120)
93.750% <= 9.183 milliseconds (cumulative count 937531)
96.875% <= 11.543 milliseconds (cumulative count 968786)
98.438% <= 13.071 milliseconds (cumulative count 984393)
99.219% <= 14.135 milliseconds (cumulative count 992188)
99.609% <= 15.103 milliseconds (cumulative count 996100)
99.805% <= 16.023 milliseconds (cumulative count 998053)
99.902% <= 189.439 milliseconds (cumulative count 999025)
99.951% <= 201.471 milliseconds (cumulative count 999514)
99.976% <= 205.567 milliseconds (cumulative count 999757)
99.988% <= 207.231 milliseconds (cumulative count 999881)
99.994% <= 208.383 milliseconds (cumulative count 999942)
99.997% <= 209.023 milliseconds (cumulative count 999971)
99.998% <= 209.535 milliseconds (cumulative count 999985)
99.999% <= 209.791 milliseconds (cumulative count 999993)
100.000% <= 210.175 milliseconds (cumulative count 999999)
100.000% <= 210.303 milliseconds (cumulative count 1000000)
100.000% <= 210.303 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.028% <= 0.103 milliseconds (cumulative count 285)
0.164% <= 0.207 milliseconds (cumulative count 1641)
0.183% <= 0.303 milliseconds (cumulative count 1833)
0.185% <= 0.407 milliseconds (cumulative count 1847)
0.187% <= 1.407 milliseconds (cumulative count 1867)
0.197% <= 1.503 milliseconds (cumulative count 1969)
0.216% <= 1.607 milliseconds (cumulative count 2160)
0.235% <= 1.703 milliseconds (cumulative count 2352)
0.261% <= 1.807 milliseconds (cumulative count 2606)
0.290% <= 1.903 milliseconds (cumulative count 2900)
0.334% <= 2.007 milliseconds (cumulative count 3339)
0.413% <= 2.103 milliseconds (cumulative count 4129)
3.437% <= 3.103 milliseconds (cumulative count 34374)
25.062% <= 4.103 milliseconds (cumulative count 250622)
55.178% <= 5.103 milliseconds (cumulative count 551777)
75.590% <= 6.103 milliseconds (cumulative count 755903)
85.505% <= 7.103 milliseconds (cumulative count 855052)
90.831% <= 8.103 milliseconds (cumulative count 908305)
93.584% <= 9.103 milliseconds (cumulative count 935838)
95.218% <= 10.103 milliseconds (cumulative count 952179)
96.422% <= 11.103 milliseconds (cumulative count 964217)
97.469% <= 12.103 milliseconds (cumulative count 974694)
98.470% <= 13.103 milliseconds (cumulative count 984700)
99.199% <= 14.103 milliseconds (cumulative count 991986)
99.610% <= 15.103 milliseconds (cumulative count 996100)
99.819% <= 16.103 milliseconds (cumulative count 998191)
99.866% <= 17.103 milliseconds (cumulative count 998662)
99.892% <= 18.111 milliseconds (cumulative count 998917)
99.898% <= 19.103 milliseconds (cumulative count 998984)
99.899% <= 20.111 milliseconds (cumulative count 998990)
99.900% <= 21.103 milliseconds (cumulative count 999000)
99.901% <= 186.111 milliseconds (cumulative count 999010)
99.901% <= 187.135 milliseconds (cumulative count 999013)
99.902% <= 188.159 milliseconds (cumulative count 999017)
99.902% <= 189.183 milliseconds (cumulative count 999023)
99.903% <= 190.207 milliseconds (cumulative count 999028)
99.904% <= 191.103 milliseconds (cumulative count 999039)
99.904% <= 192.127 milliseconds (cumulative count 999045)
99.905% <= 193.151 milliseconds (cumulative count 999049)
99.905% <= 194.175 milliseconds (cumulative count 999050)
99.905% <= 195.199 milliseconds (cumulative count 999052)
99.906% <= 196.223 milliseconds (cumulative count 999057)
99.912% <= 197.119 milliseconds (cumulative count 999119)
99.921% <= 198.143 milliseconds (cumulative count 999213)
99.930% <= 199.167 milliseconds (cumulative count 999304)
99.941% <= 200.191 milliseconds (cumulative count 999405)
99.950% <= 201.215 milliseconds (cumulative count 999495)
99.954% <= 202.111 milliseconds (cumulative count 999541)
99.960% <= 203.135 milliseconds (cumulative count 999599)
99.967% <= 204.159 milliseconds (cumulative count 999667)
99.973% <= 205.183 milliseconds (cumulative count 999732)
99.982% <= 206.207 milliseconds (cumulative count 999816)
99.987% <= 207.103 milliseconds (cumulative count 999872)
99.993% <= 208.127 milliseconds (cumulative count 999935)
99.997% <= 209.151 milliseconds (cumulative count 999975)
100.000% <= 210.175 milliseconds (cumulative count 999999)
100.000% <= 211.199 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 91066.39 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        5.628     0.040     4.919     9.951    13.799   210.303